In [1]:
import pandas as pd

In [2]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

In [3]:
data

{'apples': [3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}

In [4]:
df = pd.DataFrame(data)

In [7]:
df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [64]:
df.describe()

          apple    orange
count  4.000000  4.000000
mean   4.000000  5.000000
std    2.581989  2.581989
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.500000  6.500000
max    7.000000  8.000000

In [10]:
df.loc[1]

apples     2
oranges    3
Name: 1, dtype: int64

In [15]:
df = pd.read_csv('purchase.csv')

In [16]:
df

   apple  orange
0      1       2
1      3       4
2      5       6
3      7       8

In [17]:
df = pd.read_json('purchase.json')

In [18]:
df

   apple  ornage
0      1       5
1      2       6
2      3       7
3      4       8

In [34]:
df = pd.read_csv('purchase.csv')
df.info

<bound method DataFrame.info of    apple  orange
0      1       2
1      3       4
2      5       6
3      7       8>

In [31]:
df.head(2)

   apple  orange
0      1       2
1      3       4

In [53]:
df

   apple  orange
0      1       2
1      3       4
2      5       6
3      7       8

In [59]:
frames = [df, df]
result = pd.concat(frames)
result

   apple  orange
0      1       2
1      3       4
2      5       6
3      7       8
0      1       2
1      3       4
2      5       6
3      7       8

In [62]:
result.shape

(4, 2)

In [61]:
result = result.drop_duplicates()

In [57]:
result.shape

(4, 2)

In [63]:
df.columns

Index(['apple', 'orange'], dtype='object')